; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	image1 - mode
	spectrograph2 - mode
	image3 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Planet4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 image3)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 infrared0)
	(supports instrument3 image3)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument4 image3)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 image1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument7 image1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 spectrograph2)
	(supports instrument8 image1)
	(supports instrument8 image3)
	(calibration_target instrument8 Star2)
	(supports instrument9 image3)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite3 Planet5)
	(have_image Planet4 image3)
	(have_image Planet5 spectrograph2)
	(have_image Planet6 spectrograph2)
	(have_image Star7 spectrograph2)
	(have_image Phenomenon8 image3)
	(have_image Star9 infrared0)
	(have_image Planet10 infrared0)
	(have_image Star12 image1)
	(have_image Star13 infrared0)
	(have_image Star14 image3)
	(have_image Phenomenon15 image1)
	(have_image Planet16 spectrograph2)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 13
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 13
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 13
4. (turn_to satellite4 groundstation3 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 groundstation3)
   goals met: 0 of 13
5. (calibrate satellite4 instrument10 groundstation3)
   added: (calibrated instrument10)
   goals met: 0 of 13
6. (turn_to satellite4 planet10 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 planet10)
   goals met: 0 of 13
7. (take_image satellite4 planet10 instrument10 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 1 of 13
8. (turn_to satellite4 star13 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 star13)
   goals met: 1 of 13
9. (take_image satellite4 star13 instrument10 infrared0)
   added: (have_image star13 infrared0)
   goals met: 2 of 13
10. (turn_to satellite4 star9 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star9)
   goals met: 2 of 13
11. (take_image satellite4 star9 instrument10 infrared0)
   added: (have_image star9 infrared0)
   goals met: 3 of 13
12. (turn_to satellite3 planet5 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 planet5)
   goals met: 4 of 13
13. (turn_to satellite2 groundstation1 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation1)
   goals met: 4 of 13
14. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 4 of 13
15. (turn_to satellite2 phenomenon15 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon15)
   goals met: 4 of 13
16. (take_image satellite2 phenomenon15 instrument5 image1)
   added: (have_image phenomenon15 image1)
   goals met: 5 of 13
17. (turn_to satellite2 planet16 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 planet16)
   goals met: 5 of 13
18. (take_image satellite2 planet16 instrument5 spectrograph2)
   added: (have_image planet16 spectrograph2)
   goals met: 6 of 13
19. (turn_to satellite2 planet5 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet5)
   goals met: 6 of 13
20. (take_image satellite2 planet5 instrument5 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 7 of 13
21. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   goals met: 7 of 13
22. (take_image satellite2 planet6 instrument5 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 8 of 13
23. (turn_to satellite2 star12 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star12)
   goals met: 8 of 13
24. (take_image satellite2 star12 instrument5 image1)
   added: (have_image star12 image1)
   goals met: 9 of 13
25. (turn_to satellite2 star7 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star7)
   goals met: 9 of 13
26. (take_image satellite2 star7 instrument5 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 10 of 13
27. (turn_to satellite0 groundstation1 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation1)
   goals met: 10 of 13
28. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 10 of 13
29. (turn_to satellite0 phenomenon8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon8)
   goals met: 10 of 13
30. (take_image satellite0 phenomenon8 instrument1 image3)
   added: (have_image phenomenon8 image3)
   goals met: 11 of 13
31. (turn_to satellite0 planet4 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet4)
   goals met: 11 of 13
32. (take_image satellite0 planet4 instrument1 image3)
   added: (have_image planet4 image3)
   goals met: 12 of 13
33. (turn_to satellite0 star14 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star14)
   goals met: 12 of 13
34. (take_image satellite0 star14 instrument1 image3)
   added: (have_image star14 image3)
   goals met: 13 of 13
